# CorrectionFactorSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSet Constructor
CorrectionFactorSet Class See Also
---
Initializes a new instance of the CorrectionFactorSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CorrectionFactorSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CorrectionFactorSet()
```

# See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace